Revit 2024 API
BuiltInFailures.FabricAreaFailures Members
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures.FabricAreaFailures type exposes the following members.
Properties
Name | Description
FabricAreaLapSplicesIncorrect
 Fabric Area lap splice is incorrect.
FabricAreaOutSideOfHost
 Fabric Area is sketched completely outside of its host.
See Also
BuiltInFailures.FabricAreaFailures Class
Autodesk.Revit.DB Namespace